package com.cxy.kotlin.study

import org.apache.coyote.http11.Constants.a

/**
 * 控制流学习
 * 控制流：if、when、for、while
 */
fun main(args: Array<String>) {

    //在 Kotlin 中，if是一个表达式，即它会返回一个值。 因此就不需要三元运算符（条件 ? 然后 : 否则），因为普通的 if 就能胜任这个角色。
    // 传统用法
    //var max = a
    //if (a < b) max = b

    // With else
    //var max: Int
    //if (a > b) {
    //  max = a
    //} else {
    //  max = b
    //}

    // 作为表达式
    //val max = if (a > b) a else b

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

    //
    //

}